tutorials/incompressible/potentialFreeSurfaceFoam/oscillatingBox/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application potentialFreeSurfaceFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.4;

maxDeltaT       1;

functions
{
    forces
    {
	type 		forces;
	functionObjectLibs ("libforces.so");
	outputControl	outputTime;
	outputInterval	1;
	patches 	(floatingObject);
	pName		p;
	UName		U;
	rhoName		rhoInf;
	log		true;
	rhoInf		1000;
	CofR		(0 0 0);
    }

    poolHeight
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        timeInteval     1;
        log             true;
        valueOutput     false;
        source          faceZone;
        sourceName      f0;
        operation       areaAverage;
        fields
        (
            zeta
        );
        
    }
};

// ************************************************************************* //
