tutorials/incompressible/potentialFreeSurfaceFoam/oscillatingBox/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.1 0.8 -100) (0.4 100 100);
        }
    }

    {
        name    c0;
        type    cellSet;
        action  invert;
    }

    {
        name    f0;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   freeSurface;
        }
    }

    {
        name    f0;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            box (-100 0.9 -100) (0.2 100 100);
        }
    }

    {
        name    f0;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet    f0;
        }
    }
);

// ************************************************************************* //
